src/БиблиотекаИнструментовРазработки/src/Catalogs/бир_АдресаСервисов/бир_АдресаСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бир_АдресаСервисов</name>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресРесурса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/БиблиотекаИнструментовРазработки/src/CommonModules/бир_ВнешниеИБПолучениеДанных/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ИНТЕРФЕЙС ПОЛУЧЕНИЯ ДАННЫХ ИЗ ВНЕШНИХ БАЗ ЧЕРЕЗ СЕРВИС IDBData
//

#Область ПрограммныйИнтерфейс

#Область ИнтерфейсПолученияДанных

// Функция получает результат запроса из внешней ИБ через http-сервис IDBData.GetQueryResult
//
// Параметры:
//   НастройкиПодключения         - Структура              - настройки подключения к http-сервису:
//     *Сервис_Сервер               - Строка                 - адрес сервера http-сервиса
//     *Сервис_АдресРесурса         - Строка                 - адрес ресурса http-сервиса
//     *Сервис_Пользователь         - Строка                 - имя пользователя сервиса
//     *Сервис_Пароль               - Строка                 - пароль пользователя сервиса
//     *Соединение                  - HTTPСоединение         - полученный ранее объект соединения
//                                                             с http-сервисом для повторного использования
//     *Соединение_Использование    - Булево                 - флаг необходимости повторного использования
//                                                             объекта соединения с http-сервисом 
//     *Таймаут                     - Число                  - время ожидания соединения
//   Поля                        - Строка                  - список получаемых полей, разделенный ","
//                                 Массив из Строка          или массив имен получаемых полей
//
// Возвращаемое значение:
//   Строка, Массив из Строка - результат выполнения запроса
//
Функция Запросы(НастройкиПодключения, Знач Поля = "") Экспорт

	Если НЕ ЗначениеЗаполнено(Поля) Тогда
		Поля = Новый Массив();
	КонецЕсли;
	Если ТипЗнч(Поля) = Тип("Строка") Тогда
		Поля = СтрРазделить(Поля, ",", Ложь);
	КонецЕсли;
	
	ПараметрыURL = Новый Соответствие();
	Если ТипЗнч(Поля) = Тип("Массив") Тогда
		Для й = 0 По Поля.ВГраница() Цикл
			Поля[й] = СокрЛП(Поля[й]);
		КонецЦикла;
		ПараметрыURL.Вставить("fields", СтрСоединить(Поля, ","));
	КонецЕсли;

	АдресСервиса = СтрШаблон("%1%2/GetQueriesList",
	                         НастройкиПодключения.Сервис_Сервер,
	                         НастройкиПодключения.Сервис_АдресРесурса);

	ДопПараметры = ПараметрыHTTPЗапроса(НастройкиПодключения);
	
	Попытка
		ОтветСервиса = бир_КоннекторHTTP.Get(АдресСервиса, ПараметрыURL, ДопПараметры);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка получения списка запросов в сервисе ""%1"":%2%3",
		                        АдресСервиса,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Если НЕ ОтветСервиса.КодСостояния = бир_ВнешниеИБОбработкаЗапросов.КодыСостояния().Успешно_200 Тогда
		ТекстОшибки = ПолучитьСтрокуИзДвоичныхДанных(ОтветСервиса.Тело);
		ТекстОшибки = СтрШаблон("Ошибка получения списка запросов в сервисе ""%1"", код состояния (%2):%3%4",
		                        АдресСервиса,
		                        ОтветСервиса.КодСостояния,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;

	Попытка
		ДанныеОтвета = бир_КоннекторHTTP.КакJson(ОтветСервиса, ДопПараметры.ПараметрыПреобразованияJSON);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка получения списка запросов в сервисе ""%1"":%2%3",
		                        АдресСервиса,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Возврат ПреобразованиеДанных().ЗначениеИзСтруктуры(ДанныеОтвета);

КонецФункции // Запросы()

// Функция получает результат запроса из внешней ИБ через http-сервис IDBData.GetQueryResult
//
// Параметры:
//   НастройкиПодключения         - Структура              - настройки подключения к http-сервису:
//     *Сервис_Сервер               - Строка                 - адрес сервера http-сервиса
//     *Сервис_АдресРесурса         - Строка                 - адрес ресурса http-сервиса
//     *Сервис_Пользователь         - Строка                 - имя пользователя сервиса
//     *Сервис_Пароль               - Строка                 - пароль пользователя сервиса
//     *Соединение                  - HTTPСоединение         - полученный ранее объект соединения
//                                                             с http-сервисом для повторного использования
//     *Соединение_Использование    - Булево                 - флаг необходимости повторного использования
//                                                             объекта соединения с http-сервисом 
//     *Таймаут                     - Число                  - время ожидания соединения
//   ИдЗапроса                   - Строка                  - идентификатор запроса во внешней ИБ
//   Поля                        - Строка                  - список получаемых полей, разделенный ","
//                                 Массив из Строка          или массив имен получаемых полей
//
// Возвращаемое значение:
//   Строка, Массив из Строка - результат выполнения запроса
//
Функция ОписаниеЗапроса(НастройкиПодключения, ИдЗапроса, Знач Поля = "") Экспорт

	Если НЕ ЗначениеЗаполнено(Поля) Тогда
		Поля = Новый Массив();
	КонецЕсли;
	Если ТипЗнч(Поля) = Тип("Строка") Тогда
		Поля = СтрРазделить(Поля, ",", Ложь);
	КонецЕсли;
	
	ПараметрыURL = Новый Соответствие();
	ПараметрыURL.Вставить("id", ИдЗапроса);
	Если ТипЗнч(Поля) = Тип("Массив") Тогда
		Для й = 0 По Поля.ВГраница() Цикл
			Поля[й] = СокрЛП(Поля[й]);
		КонецЦикла;
		ПараметрыURL.Вставить("fields", СтрСоединить(Поля, ","));
	КонецЕсли;

	АдресСервиса = СтрШаблон("%1%2/GetQueryDescription",
	                         НастройкиПодключения.Сервис_Сервер,
	                         НастройкиПодключения.Сервис_АдресРесурса);

	ДопПараметры = ПараметрыHTTPЗапроса(НастройкиПодключения);
	
	Попытка
		ОтветСервиса = бир_КоннекторHTTP.Get(АдресСервиса, ПараметрыURL, ДопПараметры);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка получения описания запроса ""%1"" в сервисе ""%2"":%3%4",
		                        ИдЗапроса,
		                        АдресСервиса,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Если НЕ ОтветСервиса.КодСостояния = бир_ВнешниеИБОбработкаЗапросов.КодыСостояния().Успешно_200 Тогда
		ТекстОшибки = ПолучитьСтрокуИзДвоичныхДанных(ОтветСервиса.Тело);
		ТекстОшибки = СтрШаблон("Ошибка получения описания запроса ""%1"" в сервисе ""%2"", код состояния (%3):%4%5",
		                        ИдЗапроса,
		                        АдресСервиса,
		                        ОтветСервиса.КодСостояния,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;

	Попытка
		ДанныеОтвета = бир_КоннекторHTTP.КакJson(ОтветСервиса, ДопПараметры.ПараметрыПреобразованияJSON);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка получения описания запроса ""%1"" в сервисе ""%2"":%3%4",
		                        ИдЗапроса,
		                        АдресСервиса,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Возврат ПреобразованиеДанных().ЗначениеИзСтруктуры(ДанныеОтвета);

КонецФункции // ОписаниеЗапроса()

// Функция получает результат запроса из внешней ИБ через http-сервис IDBData.GetQueryResult
//
// Параметры:
//   НастройкиПодключения         - Структура              - настройки подключения к http-сервису:
//     *Сервис_Сервер               - Строка                 - адрес сервера http-сервиса
//     *Сервис_АдресРесурса         - Строка                 - адрес ресурса http-сервиса
//     *Сервис_Пользователь         - Строка                 - имя пользователя сервиса
//     *Сервис_Пароль               - Строка                 - пароль пользователя сервиса
//     *Соединение                  - HTTPСоединение         - полученный ранее объект соединения
//                                                             с http-сервисом для повторного использования
//     *Соединение_Использование    - Булево                 - флаг необходимости повторного использования
//                                                             объекта соединения с http-сервисом 
//     *Таймаут                     - Число                  - время ожидания соединения
//   ИдЗапроса                   - Строка                  - идентификатор запроса во внешней ИБ
//   ПараметрыЗапроса            - Массив из Структура     - параметры запроса
//                                                           для передачи во внешний запрос
//   ДополнительныеПараметры     - Структура               - Дополнительные параметры запроса
//
// Возвращаемое значение:
//   Строка, Массив из Строка - результат выполнения запроса
//
Функция РезультатЗапроса(НастройкиПодключения,
                         ИдЗапроса,
                         ПараметрыЗапроса = Неопределено,
                         ДополнительныеПараметры = Неопределено) Экспорт

	ПараметрыURL = Новый Соответствие();
	ПараметрыURL.Вставить("id", ИдЗапроса);

	АдресСервиса = СтрШаблон("%1%2/GetQueryResult",
	                         НастройкиПодключения.Сервис_Сервер,
	                         НастройкиПодключения.Сервис_АдресРесурса);

	ПараметрыHTTPЗапроса = ПараметрыHTTPЗапроса(НастройкиПодключения);

	ЕстьПараметры = (ТипЗнч(ПараметрыЗапроса) = Тип("Массив") И НЕ ПараметрыЗапроса.Количество() = 0)
	            ИЛИ (ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И НЕ ДополнительныеПараметры.Количество() = 0);
	Если ЕстьПараметры Тогда
		ТелоЗапроса = Новый Структура();
		ТелоЗапроса.Вставить("Параметры"              , ПараметрыЗапроса);
		ТелоЗапроса.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
		ТелоЗапроса = ПреобразованиеДанных().ЗаписатьОписаниеОбъектаВJSON(ТелоЗапроса);

		ПараметрыHTTPЗапроса.Вставить("ПараметрыЗапроса", ПараметрыURL);
	Иначе
		ТелоЗапроса = "";
	КонецЕсли;

	Попытка
		Если ЕстьПараметры Тогда
			ОтветСервиса = бир_КоннекторHTTP.Post(АдресСервиса, ТелоЗапроса, ПараметрыHTTPЗапроса);
		Иначе
			ОтветСервиса = бир_КоннекторHTTP.Get(АдресСервиса, ПараметрыURL, ПараметрыHTTPЗапроса);
		КонецЕсли;
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка выполнения запроса ""%1"" в сервисе ""%2"":%3%4",
		                        ИдЗапроса,
		                        АдресСервиса,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Если НЕ ОтветСервиса.КодСостояния = бир_ВнешниеИБОбработкаЗапросов.КодыСостояния().Успешно_200 Тогда
		ТекстОшибки = ПолучитьСтрокуИзДвоичныхДанных(ОтветСервиса.Тело);
		ТекстОшибки = СтрШаблон("Ошибка выполнения запроса ""%1"" в сервисе ""%2"", код состояния (%3):%4%5",
		                        ИдЗапроса,
		                        АдресСервиса,
		                        ОтветСервиса.КодСостояния,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;

	Попытка
		ДанныеОтвета = бир_КоннекторHTTP.КакТекст(ОтветСервиса);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка выполнения запроса ""%1"" в сервисе ""%2"":%3%4",
		                        ИдЗапроса,
		                        АдресСервиса,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Возврат ПреобразованиеДанных().ПрочитатьОписаниеОбъектаИзJSON(ДанныеОтвета);

КонецФункции // РезультатЗапроса()

// Процедура добавляет параметр к списку параметров внешнего запроса
//
// Параметры:
//   Параметры          - Массив из Строка   - Таблица содержащая параметры для передачи во внешний запрос
//   Имя                - Строка             - Имя параметра внешнего запроса
//   Значение           - Строка             - Значение параметра запроса,
//                                             для ссылочных типов должен указываться идентификатор ссылки,
//                                             полученный методом "УникальныйИдентификатор" или "ЗначениеВСтрокуВнутр"
//                                             или имя предопределенного значения
//   Тип                - Строка             - Тип значения параметра.
//                                             (например, "Строка", "СправочникСсылка.Контрагенты"),
//                                             если передается массив, то указывается тип значений в массиве.
//   Предопределенное   - Булево             - Признак что в качестве значения параметра передано
//                                             имя предопределенного значения справочника, перечисления и т.п.
//
Процедура ДобавитьПараметрЗапроса(Параметры,
                                  Имя,
                                  Значение,
                                  Тип = "",
                                  Предопределенное = Ложь) Экспорт

    Если НЕ ТипЗнч(Параметры) = Тип("Массив") Тогда
		Параметры = Новый Массив();
	КонецЕсли;

	ОписаниеПараметра = НовыйПараметрЗапроса(Имя, Значение, Тип, Предопределенное);

	Параметры.Добавить(ОписаниеПараметра);

КонецПроцедуры // ДобавитьПараметрЗапроса()

// Функция - создает описание параметра запроса
//
// Параметры:
//   Имя                - Строка    - Имя параметра внешнего запроса
//   Значение           - Строка    - Значение параметра запроса,
//                                    для ссылочных типов должен указываться идентификатор ссылки,
//                                    полученный методом "УникальныйИдентификатор" или "ЗначениеВСтрокуВнутр"
//                                    или имя предопределенного значения
//   ТипЗначения        - Строка    - Тип значения параметра.
//                                    (например, "Строка", "СправочникСсылка.Контрагенты"),
//                                    если передается массив, то указывается тип значений в массиве.
//   Предопределенное   - Булево    - Признак что в качестве значения параметра передано
//                                    имя предопределенного значения справочника, перечисления и т.п.
//
// Возвращаемое значение:
//   Структура
//     *Имя                - Строка    - Имя параметра внешнего запроса
//     *Значение           - Строка    - Значение параметра запроса,
//                                       для ссылочных типов должен указываться идентификатор ссылки,
//                                       полученный методом "УникальныйИдентификатор" или "ЗначениеВСтрокуВнутр"
//                                       или имя предопределенного значения
//     *ТипЗначения        - Строка    - Тип значения параметра.
//                                       (например, "Строка", "СправочникСсылка.Контрагенты"),
//                                       если передается массив, то указывается тип значений в массиве.
//     *Предопределенное   - Булево    - Признак что в качестве значения параметра передано
//                                       имя предопределенного значения справочника, перечисления и т.п.
//
Функция НовыйПараметрЗапроса(Имя, Значение, ТипЗначения = "", Предопределенное = Ложь) Экспорт

	Параметр = Новый Структура();
	Параметр.Вставить("Имя"             , Имя);
	Параметр.Вставить("Значение"        , Значение);
	Параметр.Вставить("ТипЗначения"     , ТипЗначения);
	Параметр.Вставить("Предопределенное", Предопределенное);

	Возврат Параметр;

КонецФункции // НовыйПараметрЗапроса()

#КонецОбласти // ИнтерфейсПолученияДанных

#Область ПодключениеКСервисам

// Функция - возвращает настройки доступа к http-сервису
//
// Параметры:
//  Сервис_Адрес                - СправочникСсылка       - описание параметров доступа к http-сервису
//                                .бир_АдресаСервисов
//  Соединение                  - HTTPСоединение         - полученный ранее объект соединения
//                                                         с http-сервисом для повторного использования
//  Таймаут                     - Число                  - время ожидания соединения
//
// Возвращаемое значение:
//   Структура                    - Структура         - настройки подключения к http-сервису:
//     *Сервис_Сервер               - Строка            - адрес сервера http-сервиса
//     *Сервис_АдресРесурса         - Строка            - адрес ресурса http-сервиса
//     *Сервис_Пользователь         - Строка            - имя пользователя сервиса
//     *Сервис_Пароль               - Строка            - пароль пользователя сервиса
//     *Соединение                  - HTTPСоединение    - полученный ранее объект соединения
//                                                        с http-сервисом для повторного использования
//     *Соединение_Использование    - Булево            - флаг необходимости повторного использования
//                                                        объекта соединения с http-сервисом 
//     *Таймаут                     - Число             - время ожидания соединения
//
Функция НастройкиПодключения(Сервис_Адрес, Соединение = Неопределено, Знач Таймаут = 0) Экспорт

	Если НЕ ЗначениеЗаполнено(Сервис_Адрес) Тогда
		ВызватьИсключение "Не указаны пастройки подключения к сервису.";
	КонецЕсли;
	Если НЕ (ТипЗнч(Сервис_Адрес) = Тип("СправочникСсылка.бир_АдресаСервисов")
		 ИЛИ ТипЗнч(Сервис_Адрес) = Тип("СправочникОбъект.бир_АдресаСервисов")
		 ИЛИ ТипЗнч(Сервис_Адрес) = Тип("СправочникВыборка.бир_АдресаСервисов")
		 ИЛИ ТипЗнч(Сервис_Адрес) = Тип("ФиксированнаяСтруктура")
		 ИЛИ ТипЗнч(Сервис_Адрес) = Тип("Структура")) Тогда
		ТекстОшибки = СтрШаблон("Некорректный тип ""%1"" настроек подключения к сервису.
		                        |Ожидается ""Справочник.бир_АдресаСервисов"" или ""Структура"".",
		                        ТипЗнч(Сервис_Адрес));
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;

	Соединение_Использование = Ложь;
	Если ТипЗнч(Соединение) = Тип("HTTPСоединение") Тогда
		Соединение_Использование = Истина;
	КонецЕсли;

	Таймаут = ?(Сервис_Адрес.Таймаут = 0, Таймаут, Сервис_Адрес.Таймаут);
	Таймаут = ?(Таймаут = 0, 20, Таймаут);

	НастройкиПодключения = Новый Структура();
	НастройкиПодключения.Вставить("Сервис_Сервер"           , Сервис_Адрес.Сервер);
	НастройкиПодключения.Вставить("Сервис_АдресРесурса"     , Сервис_Адрес.АдресРесурса);
	НастройкиПодключения.Вставить("Сервис_Пользователь"     , Сервис_Адрес.Пользователь);
	НастройкиПодключения.Вставить("Сервис_Пароль"           , Сервис_Адрес.Пароль);
	НастройкиПодключения.Вставить("Соединение_Использование", Соединение_Использование);
	НастройкиПодключения.Вставить("Соединение"              , Соединение);
	НастройкиПодключения.Вставить("Таймаут"                 , Таймаут);

	Возврат НастройкиПодключения;

КонецФункции // НастройкиПодключения()

#КонецОбласти // ПодключениеКСервисам

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

// Функция - ПараметрыHTTPЗапроса
// 
// Параметры:
//   НастройкиПодключения    - Структура    - настройки соединения с HTTP-сервисом
//
// Возвращаемое значение:
//   Структура                                             - дополнительные параметры HTTP-запроса
//	   *Заголовки                        - Соответствие      - заголовки HTTP-запроса
//	   *Аутентификация                   - Структура         - параметры аутентификации
//	      **Пользователь                   - Структура         - имя пользователя сервиса
//	      **Пароль                         - Структура         - пароль пользователя сервиса
//	   *ПараметрыПреобразованияJSON      - Структура         - параметры чтения JSON
//        **ПрочитатьВСоответствие         - Булево            - Истина - данные будут прочитаны в соответствие,
//                                                               Ложь - данные будут прочитаны в структуру
//        **ИменаСвойствСоЗначениямиДата   - Массив из Строка  - списк имен свойств, содержащих дату
//        **ФорматДатыJSON                 - ФорматДатыJSON    - формат даты
//
Функция ПараметрыHTTPЗапроса(НастройкиПодключения) Экспорт

	ТипыСодержимого = бир_ВнешниеИБОбработкаЗапросов.ТипыСодержимого();

	Заголовки = Новый Соответствие();
	Заголовки.Вставить(ТипыСодержимого.Заголовок, ТипыСодержимого.JSON);

	Аутентификация = Новый Структура();
	Аутентификация.Вставить("Пользователь", НастройкиПодключения.Сервис_Пользователь);
	Аутентификация.Вставить("Пароль"      , НастройкиПодключения.Сервис_Пароль);

	ПараметрыПреобразованияJSON = Новый Структура();
	ПараметрыПреобразованияJSON.Вставить("ПрочитатьВСоответствие"      , Ложь);
	ПараметрыПреобразованияJSON.Вставить("ИменаСвойствСоЗначениямиДата", Новый Массив());
	ПараметрыПреобразованияJSON.Вставить("ФорматДатыJSON"              , ФорматДатыJSON.ISO);

	Параметры = Новый Структура();
	Параметры.Вставить("Таймаут"                    , НастройкиПодключения.Таймаут);
	Параметры.Вставить("Заголовки"                  , Заголовки);
	Параметры.Вставить("Аутентификация"             , Аутентификация);
	Параметры.Вставить("ПараметрыПреобразованияJSON", ПараметрыПреобразованияJSON);

	Возврат Параметры;

КонецФункции // ПараметрыHTTPЗапроса()

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

// Функция - Получает обработку сериализации значений
// 
// Возвращаемое значение:
//   ОбработкаОбъект    - обработка преобразования данных
//
Функция ПреобразованиеДанных()

	Возврат Обработки.бир_ПреобразованиеДанных.Создать(); 

КонецФункции // ПреобразованиеДанных()

#КонецОбласти // СлужебныеПроцедурыИФункции
